DataProcessors/ОбщиеОбъектыРеглОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ОбщиеОбъектыРеглОтчетности</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИсторияРегистрацийВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВНалоговомОргане</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяемыйЛьготныйТерриториальныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетНомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код органа Федеральной службы государственной статистики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СамостоятельнаяКлассификационнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеСтажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбщиеОбъектыРеглОтчетности/Forms/ФормаВыбораСтруктурныхЕдиниц/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Налогоплательщик = Параметры.Налогоплательщик;
	НалоговыйКомитет = Параметры.НалоговыйКомитет;
	РежимВыбораСтруктурныхЕдиниц = Параметры.РежимВыбораСтруктурныхЕдиниц;
	
	Элементы.Налогоплательщик.ТолькоПросмотр = Истина;
		
 	УстановитьВидимостьЭлементовФормы();
	ОбновитьДерево();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДерево();
	
	Элементы.СтруктурныеЕдиницыПометка.ТриСостояния = Истина;
 	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НалоговыйКомитетПриИзменении(Элемент)
	
	ОбновитьДерево();
	РазвернутьДерево();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСтруктурныеЕдиницы

&НаКлиенте
Процедура СтруктурныеЕдиницыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Организации.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурныеЕдиницыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.РегистрацияВНалоговомОргане);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	СписокОтмеченныхСтруктурныхЕдиниц = Новый СписокЗначений;
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		СписокВыбранныхЭлементов(Организации, СписокОтмеченныхСтруктурныхЕдиниц, "Организация");
	ИначеЕсли 	РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
		СписокВыбранныхЭлементов(СтруктурныеЕдиницы, СписокОтмеченныхСтруктурныхЕдиниц,"РегистрацияВНалоговомОргане");
	КонецЕсли; 
	Закрыть(СписокОтмеченныхСтруктурныхЕдиниц); 

КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		УстановитьПометкиВоВсемДереве(Организации, "Инвертировать");
	ИначеЕсли 	РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
		УстановитьПометкиВоВсемДереве(СтруктурныеЕдиницы, "Инвертировать");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		УстановитьПометкиВоВсемДереве(Организации, "Снять");
	ИначеЕсли 	РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
		УстановитьПометкиВоВсемДереве(СтруктурныеЕдиницы, "Снять");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		УстановитьПометкиВоВсемДереве(Организации, "Установить");
	ИначеЕсли 	РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
		УстановитьПометкиВоВсемДереве(СтруктурныеЕдиницы, "Установить");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекущиеДанные)

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТекСостояние		= Родитель.Пометка;

	НайденыВключенные	= Ложь;
	НайденыВыключенные	= Ложь;

	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		
		Если Строка.Пометка = 0 Тогда
			НайденыВыключенные	= Истина;
		ИначеЕсли Строка.Пометка = 1 Тогда
			НайденыВключенные	= Истина;
		ИначеЕсли Строка.Пометка = 2 Тогда
			НайденыВыключенные	= Истина;
			НайденыВключенные	= Истина;						
		КонецЕсли; 
		
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если НайденыВключенные И НайденыВыключенные Тогда
		Пометка = 2;
	ИначеЕсли НайденыВключенные И (НЕ НайденыВыключенные) Тогда
		Пометка = 1;
	ИначеЕсли (НЕ НайденыВключенные) И НайденыВыключенные Тогда
		Пометка = 0;
	ИначеЕсли (НЕ НайденыВключенные) И (НЕ НайденыВыключенные) Тогда
		Пометка = 2;
	КонецЕсли;

	Если Пометка = ТекСостояние Тогда
		Возврат;
	Иначе
		Родитель.Пометка = Пометка;
		УстановитьПометкиРодителей(Родитель);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкиРодителейНаСервере(ТекущаяСтрока)

	Родитель = ТекущаяСтрока.Родитель;
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТекСостояние		= Родитель.Пометка;

	НайденыВключенные	= Ложь;
	НайденыВыключенные	= Ложь;

	Для Каждого Строка Из Родитель.Строки Цикл
		
		Если Строка.Пометка = 0 Тогда
			НайденыВыключенные	= Истина;
		ИначеЕсли Строка.Пометка = 1 Тогда
			НайденыВключенные	= Истина;
		ИначеЕсли Строка.Пометка = 2 Тогда
			НайденыВыключенные	= Истина;
			НайденыВключенные	= Истина;
		КонецЕсли; 
		
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденыВключенные И НайденыВыключенные Тогда
		Пометка = 2;
	ИначеЕсли НайденыВключенные И (НЕ НайденыВыключенные) Тогда
		Пометка = 1;
	ИначеЕсли (НЕ НайденыВключенные) И НайденыВыключенные Тогда
		Пометка = 0;
	ИначеЕсли (НЕ НайденыВключенные) И (НЕ НайденыВыключенные) Тогда
		Пометка = 2;
	КонецЕсли;

	Если Пометка = ТекСостояние Тогда
		Возврат;
	Иначе
		Родитель.Пометка = Пометка;
		УстановитьПометкиРодителейНаСервере(Родитель);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекущиеДанные)

	Пометка	= ТекущиеДанные.Пометка;
	Подчиненные	= ТекущиеДанные.ПолучитьЭлементы();

	Если Подчиненные.Количество() > 0 Тогда
		
		Для Каждого Строка Из Подчиненные Цикл
			Строка.Пометка = Пометка;
			УстановитьПометкиПодчиненных(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВоВсемДереве(РодительскаяСтрока, ВыполняемоеДействие)

	Для Каждого СтрокаДерева Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		Если ВыполняемоеДействие = "Установить" Тогда
			СтрокаДерева.Пометка = 1;
		ИначеЕсли ВыполняемоеДействие = "Снять" Тогда
			СтрокаДерева.Пометка = 0;
		Иначе
			СтрокаДерева.Пометка = ?(СтрокаДерева.Пометка = 1, 0, ?(СтрокаДерева.Пометка = 0, 1, СтрокаДерева.Пометка));
		КонецЕсли;
		
		Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			УстановитьПометкиВоВсемДереве(СтрокаДерева, ВыполняемоеДействие);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбранныхЭлементов(РодительскаяСтрока, СписокВыбранных, СтруктурнаяЕдиница)

	Для Каждого СтрокаДерева Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		Если НЕ СтрокаДерева.ЭтоГруппа И СтрокаДерева.Пометка = 1 Тогда
			НоваяЗапись = СписокВыбранных.Добавить();
			НоваяЗапись.Значение = СтрокаДерева[СтруктурнаяЕдиница];
			Если РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
				НоваяЗапись.Представление = СтрокаДерева.СтруктурнаяЕдиница;    
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			СписокВыбранныхЭлементов(СтрокаДерева, СписокВыбранных, СтруктурнаяЕдиница);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	ЭлементФормыДерево = Элементы.СтруктурныеЕдиницы;
	
	ЭлементыСтруктурныеЕдиницы = СтруктурныеЕдиницы.ПолучитьЭлементы();
	
	Для Каждого СтрокаВерхнегоУровня Из ЭлементыСтруктурныеЕдиницы Цикл
		ЭлементФормыДерево.Развернуть(СтрокаВерхнегоУровня.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДерево()
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		
		ДеревоСтруктурныеЕдиницы = ДанныеФормыВЗначение(Организации, Тип("ДеревоЗначений"));
		
		// сохраним текущие отмеченные структурные единицы
		Если ДеревоСтруктурныеЕдиницы.Строки.Количество() = 0 Тогда
			СохраненныйСписок = Параметры.НачальныйСписокСтруктурныхЕдиниц;
		Иначе
			СохраненныйСписок = Новый СписокЗначений;
			
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("ЭтоГруппа", Ложь);
			СтруктураПоиска.Вставить("Пометка", 1);
			
			НайденныеСтроки = ДеревоСтруктурныеЕдиницы.Строки.НайтиСтроки(СтруктураПоиска, Истина);
			Для Каждого СтрокаДерева Из НайденныеСтроки Цикл
				ЭлементСписка = СохраненныйСписок.Добавить();
				ЭлементСписка.Значение = СтрокаДерева.Организация;
			КонецЦикла;
			
			ДеревоСтруктурныеЕдиницы.Строки.Очистить();
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Налогоплательщик);
		
		Запрос.Текст = РегламентированнаяОтчетностьРК.ПолучитьТекстСтруктурныхЕдиницПоГоловнойОрганизации(); 
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ВидСтроки = 1 Тогда
				СтрокаВерхнегоУровня  = ДеревоСтруктурныеЕдиницы.Строки.Добавить();
				
				СтрокаВерхнегоУровня.Организация = Выборка.Ссылка;
				СтрокаВерхнегоУровня.ЭтоГруппа = Истина;
				СтрокаВерхнегоУровня.Картинка = Выборка.ВидСтроки - 1;
				СтрокаВерхнегоУровня.Владелец = Выборка.Владелец;
				
				СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
				
				СтрокаНижнегоУровня.Организация = Выборка.Ссылка;
				СтрокаНижнегоУровня.ЭтоГруппа = Ложь;
				СтрокаНижнегоУровня.Картинка = Выборка.ВидСтроки - 1;
				СтрокаНижнегоУровня.Владелец = Выборка.Владелец;
				
			Иначе
				
				СтрокаВерхнегоУровня = ДеревоСтруктурныеЕдиницы.Строки.Найти(Выборка.Владелец,"Владелец",Ложь);
				
				Если СтрокаВерхнегоУровня <> Неопределено Тогда
					СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
					СтрокаНижнегоУровня.Организация = Выборка.Ссылка;
					СтрокаНижнегоУровня.ЭтоГруппа = Ложь;
					СтрокаНижнегоУровня.Картинка = Выборка.ВидСтроки - 1;
					СтрокаНижнегоУровня.Владелец = Выборка.Владелец;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		//// для тех структурных единиц, которые не имеют различных подчиненных, оставим только один уровень
		Стек = Новый Массив();
		Стек.Добавить(ДеревоСтруктурныеЕдиницы);	
		ПервыйШагЦикла = Истина;
		Пока Стек.Количество() > 0 Цикл
			ИндексЭлемента = Стек.Количество() - 1;
			РодительскаяСтрока = Стек[ИндексЭлемента];
			Стек.Удалить(ИндексЭлемента);
			Если Не ПервыйШагЦикла 
				И РодительскаяСтрока.Строки.Количество() = 1 
				И РодительскаяСтрока.Организация = РодительскаяСтрока.Строки[0].Организация Тогда
				// удалим лишную дочерную строку, т.к. она полностью соответствует родительской
				РодительскаяСтрока.ЭтоГруппа = Ложь;
				РодительскаяСтрока.Строки.Удалить(0);
				
			Иначе
				Для Каждого СтрокаДерева Из РодительскаяСтрока.Строки Цикл
					Стек.Добавить(СтрокаДерева);
				КонецЦикла;
			КонецЕсли;
			ПервыйШагЦикла = Ложь;
		КонецЦикла;
		
		//// установим отметки возле структурных подразделений, сохраненных в СохраненныйСписок
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Организация");
		СтруктураПоиска.Вставить("ЭтоГруппа", Ложь);
		
		Для Каждого ЭлементСписка Из СохраненныйСписок Цикл
			СтруктураПоиска.Организация = ЭлементСписка.Значение;
			НайденныеСтроки = ДеревоСтруктурныеЕдиницы.Строки.НайтиСтроки(СтруктураПоиска, Истина);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаДерева = НайденныеСтроки[0];
				СтрокаДерева.Пометка = 1;
				УстановитьПометкиРодителейНаСервере(СтрокаДерева);
			КонецЕсли;
		КонецЦикла; 
		
		ЗначениеВДанныеФормы(ДеревоСтруктурныеЕдиницы, Организации);
		
	ИначеЕсли РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда 
		
		ДеревоСтруктурныеЕдиницы = ДанныеФормыВЗначение(СтруктурныеЕдиницы, Тип("ДеревоЗначений"));
		
		// сохраним текущие отмеченные структурные единицы
		Если ДеревоСтруктурныеЕдиницы.Строки.Количество() = 0 Тогда
			СохраненныйСписок = Параметры.НачальныйСписокСтруктурныхЕдиниц;
		Иначе
			СохраненныйСписок = Новый СписокЗначений;
			
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("ЭтоГруппа", Ложь);
			СтруктураПоиска.Вставить("Пометка", 1);
			
			НайденныеСтроки = ДеревоСтруктурныеЕдиницы.Строки.НайтиСтроки(СтруктураПоиска, Истина);
			Для Каждого СтрокаДерева Из НайденныеСтроки Цикл
				ЭлементСписка = СохраненныйСписок.Добавить();
				ЭлементСписка.Значение = СтрокаДерева.РегистрацияВНалоговомОргане;
			КонецЦикла;
			
			ДеревоСтруктурныеЕдиницы.Строки.Очистить();
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Налогоплательщик", Налогоплательщик);
		Запрос.УстановитьПараметр("Дата",             Параметры.мДатаКонцаПериодаОтчета);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения = """"
		|			ТОГДА ВЫРАЗИТЬ(ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК Справочник.Организации).Наименование
		|		ИНАЧЕ РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения
		|	КОНЕЦ КАК Наименование,
		|	1 КАК ВидСтроки,
		|	РегистрацииВНалоговомОргане.Владелец КАК Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница.ГоловнаяОрганизация = &Налогоплательщик
		|	ИЛИ ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = &Налогоплательщик
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения = """"
		|			ТОГДА ВЫРАЗИТЬ(ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).Наименование
		|		ИНАЧЕ РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения
		|	КОНЕЦ,
		|	2,
		|	РегистрацииВНалоговомОргане.Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|			&Дата,
		|			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница.ГоловнаяОрганизация = &Налогоплательщик
		|	ИЛИ ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = &Налогоплательщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСтроки,
		|	Владелец,
		|	Наименование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ВидСтроки = 1 Тогда
				СтрокаВерхнегоУровня  = ДеревоСтруктурныеЕдиницы.Строки.Добавить();
				
				СтрокаВерхнегоУровня.СтруктурнаяЕдиница = Выборка.Наименование;
				СтрокаВерхнегоУровня.ЭтоГруппа = Истина;
				СтрокаВерхнегоУровня.Картинка = Выборка.ВидСтроки - 1;
				СтрокаВерхнегоУровня.Владелец = Выборка.Владелец;
				СтрокаВерхнегоУровня.РегистрацияВНалоговомОргане = Выборка.Ссылка;
				
				СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
				
				СтрокаНижнегоУровня.СтруктурнаяЕдиница = Выборка.Наименование;
				СтрокаНижнегоУровня.ЭтоГруппа = Ложь;
				СтрокаНижнегоУровня.Картинка = Выборка.ВидСтроки - 1;
				СтрокаНижнегоУровня.Владелец = Выборка.Владелец;
				СтрокаНижнегоУровня.РегистрацияВНалоговомОргане = Выборка.Ссылка;
			Иначе
				СтрокаВерхнегоУровня = ДеревоСтруктурныеЕдиницы.Строки.Найти(Выборка.Владелец,"Владелец",Ложь);
				
				Если СтрокаВерхнегоУровня <> Неопределено Тогда
					СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
					
					СтрокаНижнегоУровня.СтруктурнаяЕдиница = Выборка.Наименование;
					СтрокаНижнегоУровня.ЭтоГруппа = Ложь;
					СтрокаНижнегоУровня.Картинка = Выборка.ВидСтроки - 1;
					СтрокаНижнегоУровня.Владелец = Выборка.Владелец;
					СтрокаНижнегоУровня.РегистрацияВНалоговомОргане = Выборка.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		//// для тех структурных единиц, которые не имеют различных подчиненных, оставим только один уровень
		Стек = Новый Массив();
		Стек.Добавить(ДеревоСтруктурныеЕдиницы);	
		ПервыйШагЦикла = Истина;
		Пока Стек.Количество() > 0 Цикл
			ИндексЭлемента = Стек.Количество() - 1;
			РодительскаяСтрока = Стек[ИндексЭлемента];
			Стек.Удалить(ИндексЭлемента);
			Если Не ПервыйШагЦикла 
				И РодительскаяСтрока.Строки.Количество() = 1 
				И РодительскаяСтрока.СтруктурнаяЕдиница = РодительскаяСтрока.Строки[0].СтруктурнаяЕдиница Тогда
				// удалим лишную дочерную строку, т.к. она полностью соответствует родительской
				РодительскаяСтрока.ЭтоГруппа = Ложь;
				РодительскаяСтрока.Строки.Удалить(0);
				
			Иначе
				Для Каждого СтрокаДерева Из РодительскаяСтрока.Строки Цикл
					Стек.Добавить(СтрокаДерева);
				КонецЦикла;
			КонецЕсли;
			ПервыйШагЦикла = Ложь;
		КонецЦикла;
		
		//// установим отметки возле структурных подразделений, сохраненных в СохраненныйСписок
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("РегистрацияВНалоговомОргане");
		СтруктураПоиска.Вставить("ЭтоГруппа", Ложь);
		
		Для Каждого ЭлементСписка Из СохраненныйСписок Цикл
			СтруктураПоиска.РегистрацияВНалоговомОргане = ЭлементСписка.Значение;
			НайденныеСтроки = ДеревоСтруктурныеЕдиницы.Строки.НайтиСтроки(СтруктураПоиска, Истина);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаДерева = НайденныеСтроки[0];
				СтрокаДерева.Пометка = 1;
				УстановитьПометкиРодителейНаСервере(СтрокаДерева);
			КонецЕсли;
		КонецЦикла; 
		
		ЗначениеВДанныеФормы(ДеревоСтруктурныеЕдиницы, СтруктурныеЕдиницы);
		
	КонецЕсли; 
	
КонецПроцедуры

	
&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		ЭтаФорма.Элементы.ГруппаСтруктурныеЕдиницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаСтруктурныеЕдиницыОрганизация;
	Иначе
		ЭтаФорма.Элементы.ГруппаСтруктурныеЕдиницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаСтруктурныеЕдиницыНалогоплательщик;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти
